import Block from "../../Components/Block/Block"
import H1 from "../../Components/H1/H1"
import H2 from "../../Components/H2/H2"
import H3 from "../../Components/H3/H3"
import { About_us_ } from "./styled"
import Task from "./Task/Task"
import TimeLine from "./Timeline/Timeline"

const About_us = () => {
    const tasks = [
        "Обеспечение правильной эксплуатации, ремонта, сохранности жилищного фонда, коммунальных предприятий и других объектов жилищно-коммунального хозяйства города",
        "Совершенствование организационной структуры управления отраслью, повышение её эффективности и удешевление стоимости предоставляемых услуг и работ",
        "Организация и координация внедрения приборов учета тепловой энергии, холодного и горячего водоснабжения на обслуживаемых объектах",
        "Обеспечение перспективного развития, проведение единой технической политики в жилищно-коммунальном хозяйстве города",
        "Проведение инвестиционной политики в развитии объектов коммунального хозяйства, благоустройства и капремонта жилфонда города",
        "Руководство и координация деятельности предприятий",
        "Обеспечение технического надзора за ремонтируемыми и строящимися объектами коммунального хозяйства, инженерными сооружениями и объектами внешнего благоустройства",
        "Выполнение функций Заказчика по капитальному ремонту (тепловая модернизация), реконструкции объектов жилищного, производственного и социального назначения",
        "Выполнение функций Заказчика по основным и дополнительным жилищно-коммунальным услугам по коммунальному жилищному фонду",
        "Осуществление контроля за зелеными насаждениями в городе, торговыми местами на городской территории",
        "Выдача разрешений на раскопки и контроль за их проведением",
        "Материально-техническое снабжение предприятий",
        "Работа с обращениями граждан",
    ]

    return (
        <About_us_>
            <Block className="intro-block">
                <H1 style={{ margin: 'auto' }}>О нас</H1>
                <H3 style={{ textAlign: 'center', fontWeight: 'normal' }}><span style={{ color: 'rgba(0,128,0)' }}>КЖУП «Буда-Кошелевский коммунальник»</span> — это предприятие с богатой историей и многолетним опытом служения людям. На протяжении более 70 лет мы обеспечиваем комфорт и благополучие жителей нашего региона.</H3>
            </Block>
            <H2>Путь развития</H2>
            <TimeLine events={[
                { year: 1951, title: 'Основание ремонтно-строительной конторы', description: 'Начало деятельности в сфере строительства и ремонта.' },
                { year: 1963, title: 'Создание Комбината коммунальных предприятий', description: 'Объединение и расширение услуг (баня, гостиница, жилфонд, водопровод).' },
                { year: 1983, title: 'Создание районного ПО ЖКХ (РПОЖКХ)', description: 'Значительное расширение зоны ответственности: Принятие на баланс городских сетей водоснабжения и канализации.' },
                { year: 1996, title: 'Регистрация под именем «Буда-Кошелевский коммунальник»', description: 'Формирование современного бренда предприятия.' },
                { year: 2002, title: 'Прием на обслуживание сельских ВКС', description: 'Расширение услуг на сельские населенные пункты.' },
                { year: 2005, title: 'Принятие объектов теплового хозяйства', description: 'Полное коммунальное обеспечение: Предприятие становится основным оператором теплоснабжения (котельных) в районе.' },
            ]} />
            <Block className="intro-block">
                <H2 style={{ margin: 'auto' }}>Сегодня</H2>
                <H3 style={{ textAlign: 'center', fontWeight: 'normal' }}><span style={{ color: 'rgba(0,128,0)' }}>КЖУП «Буда-Кошелевский коммунальник»</span> — это самостоятельное унитарное предприятие, которое обеспечивает полноценную жизнедеятельность региона.</H3>
            </Block>
            <Block style={{ flexDirection: 'column', width: '100%' }}>
                <H2>Задачи и функции</H2>
                <Block className="tasks-container">
                    {tasks.map(x => <Task key={x} name={x} />)}
                </Block>
            </Block>
        </About_us_>
    )
}

export default About_us
