import ArticleLayout from "../../../../Components/ArticleLayout/ArticleLayout";
import ContentSection from "../../../../Components/ContentSection/ContentSection";
import Paragraph from "../../../../Components/Paragraph/Paragraph";
import LinkButton from "../../../../Components/LinkButton/LinkButton";
import { GalleryImage } from "./styled";


const PomogutBy = () => {
    return (
        <ArticleLayout>
            <GalleryImage
                style={{ height: '10%', objectFit: 'cover' }}
                src="/useful_to_know/pomogut-by_icon.png"
                alt="Логотип Pomogut BY"
                loading="lazy"
            />
            <ContentSection>
                <Paragraph>
                    <strong>"<a href="https://pomogut.by/" target="_blank" rel="noopener noreferrer">Pomogut.by</a>"</strong> - информационный ресурс для людей, столкнувшихся с проблемой наркомании. Основной целью проекта является практическая помощь наркозависимым лицам в Республике Беларусь и профилактика наркомании.
                </Paragraph>
            </ContentSection>

            <ContentSection title="«Всё о наркомании»">
                <Paragraph>
                    На сайте pomogut.by мы собрали для вас самую важную информацию о проблеме наркомании. Как вовремя распознать в ребенке начинающего наркомана? Куда обращаться и кто может помочь? Какая ответственность предусмотрена за распространение наркотиков? На эти и многие другие вопросы вы найдете ответ здесь.
                </Paragraph>
            </ContentSection>

            <ContentSection title="«Помощь наркозависимым»">
                <Paragraph>
                    На сайте pomogut.by вы найдете контакты специальных организаций в Беларуси, которые оказывают услуги зависимым, созависимым и тем, кто находится в стадии ремиссии. Приведен перечень их услуг, общая информация об организации, а также имеющиеся вакансии для трудоустройства, ближайшие мероприятия и так далее.
                </Paragraph>
            </ContentSection>

            <ContentSection title="«Получить консультацию»">
                <Paragraph>
                    На сайте pomogut.by через специальную форму каждый желающий может совершенно бесплатно получить консультацию эксперта по вопросам оказания помощи наркозависимым.
                </Paragraph>
                <Paragraph>
                    Проект "POMOGUT.BY" - это объединение усилий и возможностей государства и гражданского общества. Создавая его, мы не ставили перед собой цели заставить отказаться от употребления наркотиков.
                </Paragraph>
            </ContentSection>

            <ContentSection title="Наша задача">
                <Paragraph>
                    <span style={{ fontWeight: 'bold', color: '#28a745' }}>Помочь</span> тем, кто оказался один на один со своей бедой и потерялся в океане обещаний, предложений и услуг<br />
                    <span style={{ fontWeight: 'bold', color: '#28a745' }}>Помочь</span> родителям, чьи дети оказались в плену наркозависимости<br />
                    <span style={{ fontWeight: 'bold', color: '#28a745' }}>Помочь</span> подростку сказать "нет" первой пробе<br />
                    <span style={{ fontWeight: 'bold', color: '#28a745' }}>Помочь</span> потребителю, оказавшемуся один на один с зависимостью
                </Paragraph>
            </ContentSection>

            <ContentSection title="Краткая инструкция &quot;Звонок в call-центр&quot;">
                <Paragraph>
                    Набрав номер телефона +375 (017) 311-00-00 Вы услышите инструкцию дальнейших действий;<br />
                    Если Вам нужна экстренная медицинская помощь - нажмите на клавиатуре телефона цифру "0". В этом случае консультанты call-центра переключат Вас на специалистов медучреждения;<br />
                    Если Вы не нашли на нашем сайте нужную информацию - оставайтесь на линии, Вам ответит первый освободившийся консультант call-центра.
                </Paragraph>
            </ContentSection>

            <ContentSection title="Политика проекта">
                <Paragraph>
                    Понять. Принять. Помочь - это основа деятельности тех, кто выступает здесь в качестве участников проекта. Ни один из нас не предъявляет требований отказаться от употребления наркотиков. Мы не предлагаем новых методик и не гарантируем волшебных результатов. Мы объединили усилия ради посильной помощи людям, столкнувшимся с проблемой наркотиков.
                </Paragraph>
                <Paragraph>
                    Все, собравшиеся здесь - специалисты, и знают, что все мы разные. То, что можно предложить мне, может не подойти тебе. Мы также знаем, что путь к выздоровлению - нелегкий для каждого, но самый верный для всех. Мы объединились, чтобы помочь найти для каждого свой надежный и правильный путь к решению наркотической зависимости.
                </Paragraph>

                <LinkButton href="https://pomogut.by/">
                    Перейти на сайт Pomogut.by
                </LinkButton>
            </ContentSection>
        </ArticleLayout >
    );
};

export default PomogutBy;